{
  "activation_function": "gelu_new",
  "architectures": [
    "GPT2InferenceModel"
  ],
  "attn_pdrop": 0.1,
  "bos_token_id": 8192,
  "embd_pdrop": 0.1,
  "eos_token_id": 8193,
  "gradient_checkpointing": false,
  "initializer_range": 0.02,
  "layer_norm_epsilon": 1e-05,
  "model_type": "gpt2",
  "n_ctx": 1402,
  "n_embd": 1280,
  "n_head": 20,
  "n_inner": null,
  "n_layer": 24,
  "n_positions": 803,
  "reorder_and_upcast_attn": false,
  "resid_pdrop": 0.1,
  "scale_attn_by_inverse_layer_idx": false,
  "scale_attn_weights": true,
  "summary_activation": null,
  "summary_first_dropout": 0.1,
  "summary_proj_to_labels": true,
  "summary_type": "cls_index",
  "summary_use_proj": true,
  "torch_dtype": "float32",
  "transformers_version": "4.52.4",
  "use_cache": true,
  "vocab_size": 8194
}
